ETL/Catalogs/СчетУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>СчетУчета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>База</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Базы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Аналитика</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валютный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто6</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто7</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто8</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто9</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Субконто10</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активный</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количественный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валютный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Субконто</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяСубконто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ETL/Catalogs/СчетУчета/Forms/ФормаЭлемента/Ext/Form/Module.bsl
//******************************************************************************************
&НаСервере
Функция ЗаполнитьНаСервере()
	
	НаименованиеМакета = "";
	
	Для Каждого Макет Из Метаданные.Справочники.СчетУчета.Макеты Цикл 
		
		//Если СокрЛП(Макет.Синоним) = СокрЛП(Объект.Владелец.Наименование) Тогда 
		//	
		//	НаименованиеМакета = Макет.Имя;
		//	
		//КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(НаименованиеМакета) Тогда 

		Возврат Ложь;
		
	КонецЕсли;
	
	Объект.Счета.Очистить();
	Объект.Аналитика.Очистить();
	
	ТекущийМакет = Справочники.СчетУчета.ПолучитьМакет(НаименованиеМакета);

	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("_1",	 "Счет");
	Соответствие.Вставить("_2",	 "Наименование");
	Соответствие.Вставить("_3",	 "Активный");
	Соответствие.Вставить("_4",	 "Валютный");
	Соответствие.Вставить("_6",	 "Субконто1");
	Соответствие.Вставить("_5",	 "Количественный");
	Соответствие.Вставить("_7",	 "Субконто2");
	Соответствие.Вставить("_8",	 "Субконто3");
	Соответствие.Вставить("_9",	 "Субконто4");
	Соответствие.Вставить("_10", "Субконто5");
	
	Для Строка = 2 По ТекущийМакет.ВысотаСтраницы Цикл
		
		СтруктураСчета = Новый Структура;
		
		Для Колонка = 1 По 10 Цикл
			
			Значение = ТекущийМакет.Область("R" + Строка + "C" + Колонка).Текст;
			
			Если НЕ ПустаяСтрока(Значение) Тогда
				
				СтруктураСчета.Вставить(Соответствие.Получить("_" + Колонка), Значение);
				
			КонецЕсли;      
			
		КонецЦикла;
		
		Если СтруктураСчета.Свойство("Счет") Тогда
			
			ЗаполнитьЗначенияСвойств(Объект.Счета.Добавить(),		 СтруктураСчета);
			ЗаполнитьЗначенияСвойств(Объект.Аналитика.Добавить(),	 СтруктураСчета);
			
		КонецЕсли;      
		
	КонецЦикла;
	
	Объект.Счета.Сортировать("Счет Возр");
	Объект.Аналитика.Сортировать("Счет Возр");

	Возврат Истина;

КонецФункции
//******************************************************************************************
&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт 
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		
		Возврат;
		
	КонецЕсли;

	Если НЕ ЗаполнитьНаСервере() Тогда 
		
		ПоказатьПредупреждение(, "Не найден макет для данного типа базы");
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры
//******************************************************************************************
&НаКлиенте
Процедура Заполнить(Команда)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда 
	//	
	//	ПоказатьПредупреждение(, "Выберите тип базы!");
	//	
	//	Возврат;
	//	
	//КонецЕсли;

	ПоказатьВопрос(Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект, Параметры), "Данные будут очищены, продолжить?", РежимДиалогаВопрос.ДаНет, 0);

КонецПроцедуры
//******************************************************************************************
